Revit 2027 API
IPerformanceAdviserRule.ExecuteElementCheck Method
 Invoked by performance advisor for each element to be checked.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
void ExecuteElementCheck(
	Document document,
	Element element
)
Sub ExecuteElementCheck (
	document As Document,
	element As Element
)
void ExecuteElementCheck(
	Document^ document,
	Element^ element
)
abstract ExecuteElementCheck :
        document : Document *
        element : Element -> unit
Parameters
document Document
 Document for which performance problems are being checked.
element Element
 The Element being checked for performance problems.
See Also
Reference
IPerformanceAdviserRule Interface
Autodesk.Revit.DB Namespace